will-rigby/STM32F410RBT6-WaterQualitySensor/Firmware/src/stm32f410_1wire.c
/**
 ******************************************************************************
 * @file    stm32f410_1wire.c
 * @author  William Rigby
 * @date    220317
 * @brief   Drives the 1wire interface to communicate with the DS18B20
 *
 ******************************************************************************
 *     EXTERNAL FUNCTIONS
 ******************************************************************************

 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "stm32f410_1wire.h"
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Function Definitions -------------------------------------------------------*/

extern void oneWire_init(void) {
	/* Initialize Timer 5 for keep track of Microseconds */
	__TIM5_CLK_ENABLE()
	;

	/* Initialise the timer used for counting microseconds */
	oneWireTimer.Instance = TIM5;
	oneWireTimer.Init.Prescaler = 80;
	oneWireTimer.Init.Period = 0xFFFF;
	oneWireTimer.Init.ClockDivision = 0;
	oneWireTimer.Init.RepetitionCounter = 0;
	oneWireTimer.Init.CounterMode = TIM_COUNTERMODE_UP;

	HAL_TIM_Base_Init(&oneWireTimer);
	HAL_TIM_Base_Start(&oneWireTimer);

	/* Configure GPIO Pins for input */
	GPIOA->MODER &= ~(0b11<<16); // Set Input
	GPIOB->OTYPER |= (1 << 8); // Set to Open Drain
	GPIOB->PUPDR &= ~((1 << 16)|(1 << 17)); // Set No Pull
	GPIOB->OSPEEDR |= (1 << 16)|(1 << 17); // Set Speed High

	GPIOA->ODR &= ~(0b100000000);

}

void delay_us(uint16_t microseconds) {
	uint16_t currentValue = __HAL_TIM_GET_COUNTER(&oneWireTimer);
	uint16_t waitValue = microseconds + currentValue;
	while (__HAL_TIM_GET_COUNTER(&oneWireTimer) < waitValue)
		;
}

/* Function to write a bit to the 1-Wire Device */
void write_bit(uint8_t bit) {

	/* if 1 hold low for 14us */
	if (bit) {
		oneWire_set_pin_output();
		delay_us(10);
		oneWire_set_pin_input();
		delay_us(60);
		/* if 0 hold low for 60us */
	} else {
		oneWire_set_pin_output();
		delay_us(60);
		oneWire_set_pin_input();
		delay_us(5);
	}
}

/* Function to write a byte to the 1-wire device */
void onewire_write_byte(uint8_t byte) {
	for (int i = 0; i < 8; i++) {
		write_bit(byte & 1);
		byte = byte >> 1;
	}
}

/* Read Byte from 1-Wire Device Function */
uint8_t onewire_read_byte(void) {
	uint8_t byte = 0;
	uint8_t bit = 0;
	for (int i = 0; i < 8; i++) {

		/* Set to output */
		oneWire_set_pin_output();
		delay_us(5);

		/* Set to input then delay 30us */
		oneWire_set_pin_input();

		delay_us(12);

		/* Read input and add to byte */
		bit = (((GPIOA->IDR >> 8)) & 1) << i;
		byte = byte | bit;

		/* delay 30us */
		delay_us(40);

	}
	return byte;
}

/* Reset the 1-Wire Device */
extern uint8_t onewire_reset(void) {
	uint8_t output = 1;

	/* Write low for 500us */
	oneWire_set_pin_output();
	delay_us(400);

	/* Set input */
	oneWire_set_pin_input();

	for (int i = 0; i < 60; i++) {
		delay_us(10);
		if ((GPIOA->IDR & 0b100000000) == 0) {
			output = 0;
		}
	}
	/* Simulated Presence */
#ifdef ONEWIREDEBUG
	oneWire_set_pin_output();
	delay_us(52);
	oneWire_set_pin_input();
#endif

	return output;
}

/* Read the temperature and return a float from the DS18B20 */
extern float onewire_read_ds18b20_temp(void) {
	/* Reset Devices */
	onewire_reset();

	/* Skip ROM */
	onewire_write_byte(0xcc);
	delay_us(200);

	/* Write Scratchpad */
	onewire_write_byte(0x4E);
	delay_us(200);

	/* Write Data */
	onewire_write_byte(0);
	delay_us(200);
	onewire_write_byte(0);
	delay_us(200);
	onewire_write_byte(0b00111111);
	delay_us(200);

	/* Reset again */
	onewire_reset();
	delay_us(200);
	/* Skip ROM */
	onewire_write_byte(0xcc);
	delay_us(200);

	/* Start Temperature Conversion Command */
	onewire_write_byte(0x44);
	delay_us(200);

	/* Wait for conversion */
	HAL_Delay(200);

	/* Reset again */
	onewire_reset();
	delay_us(200);
	/* Skip ROM */
	onewire_write_byte(0xcc);
	delay_us(200);

	/* Read Scratchpad Command */
	onewire_write_byte(0xBE);
	delay_us(200);

	/* Read TH and TL bytes */
	uint8_t tempLowByte = onewire_read_byte();

	delay_us(200);
	uint8_t tempHighByte = onewire_read_byte();
	delay_us(200);

	/* Reset again */
	onewire_reset();

	/* Deconstruct TL & TH to obtain temperature float */
	float temperature = 0;
	if (0b1 & tempLowByte) {
		temperature += 0.0625;
	}
	if (0b10 & tempLowByte) {
		temperature += 0.125;
	}
	if (0b100 & tempLowByte) {
		temperature += 0.25;
	}
	if (0b1000 & tempLowByte) {
		temperature += 0.5;
	}
	if (0b10000 & tempLowByte) {
		temperature += 1;
	}
	if (0b100000 & tempLowByte) {
		temperature += 2;
	}
	if (0b1000000 & tempLowByte) {
		temperature += 4;
	}
	if (0b10000000 & tempLowByte) {
		temperature += 8;
	}
	if (0b1 & tempHighByte) {
		temperature += 16;
	}
	if (0b10 & tempHighByte) {
		temperature += 32;
	}
	if (0b100 & tempHighByte) {
		temperature += 64;
	}

	return temperature;
}

/* Read the temperature and return 2 integers representing a float */
extern void onewire_read_ds18b20_temp_int16(int16_t intAndDec[2]) {
	/* Reset Devices */
	onewire_reset();

	/* Skip ROM */
	onewire_write_byte(0xcc);
	delay_us(200);

	/* Write Scratchpad */
	onewire_write_byte(0x4E);
	delay_us(200);

	/* Write Data */
	onewire_write_byte(0);
	delay_us(200);
	onewire_write_byte(0);
	delay_us(200);
	onewire_write_byte(0b00111111);
	delay_us(200);

	/* Reset again */
	onewire_reset();
	delay_us(200);
	/* Skip ROM */
	onewire_write_byte(0xcc);
	delay_us(200);

	/* Start Temperature Conversion Command */
	onewire_write_byte(0x44);
	delay_us(200);

	/* Wait for conversion */
	HAL_Delay(200);

	/* Reset again */
	onewire_reset();
	delay_us(200);
	/* Skip ROM */
	onewire_write_byte(0xcc);
	delay_us(200);

	/* Read Scratchpad Command */
	onewire_write_byte(0xBE);
	delay_us(200);

	/* Read TH and TL bytes */
	uint8_t tempLowByte = onewire_read_byte();

	delay_us(200);
	uint8_t tempHighByte = onewire_read_byte();
	delay_us(200);

	/* Reset again */
	onewire_reset();

	/* Deconstruct TL & TH to obtain temperature float */

	intAndDec[0] = 0;
	intAndDec[1] = 0;
	if (0b1 & tempLowByte) {
		intAndDec[1]+= 625;
	}
	if (0b10 & tempLowByte) {
		intAndDec[1] += 1250;
	}
	if (0b100 & tempLowByte) {
		intAndDec[1] += 2500;
	}
	if (0b1000 & tempLowByte) {
		intAndDec[1] += 5000;
	}
	if (0b10000 & tempLowByte) {
		intAndDec[0] += 1;
	}
	if (0b100000 & tempLowByte) {
		intAndDec[0] += 2;
	}
	if (0b1000000 & tempLowByte) {
		intAndDec[0] += 4;
	}
	if (0b10000000 & tempLowByte) {
		intAndDec[0] += 8;
	}
	if (0b1 & tempHighByte) {
		intAndDec[0] += 16;
	}
	if (0b10 & tempHighByte) {
		intAndDec[0] += 32;
	}
	if (0b100 & tempHighByte) {
		intAndDec[0] += 64;
	}

}

/* 1us Delay on a 8MHz micro-controller using assembly code "No Operation" */
void delay_1us(void) {
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
}

/* 5us Delay on a 8MHz micro-controller using assembly code "No Operation" */
void delay_5us(void) {
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
}

/* 5us Delay on a 8MHz micro-controller using assembly code "No Operation" */
void delay_10us(void) {
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
}

/* 5us Delay on a 8MHz micro-controller using assembly code "No Operation" */
void delay_100us(void) {
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
	asm("NOP");
}

/* Sets the pin to input */
void oneWire_set_pin_input(void) {
	GPIOA->MODER = ~(0b110000000000000000) & GPIOA->MODER;
}

/* Sets the pin to output */
void oneWire_set_pin_output(void) {
	GPIOA->MODER = (0b010000000000000000) | GPIOA->MODER;
}
